{
  "skills": {
    "primary": [
      "React JS",
      "TypeScript",
      "Javascript",
      "Node",
      "Express",
      "MongoDB",
      "MySQL",
      "Firebase",
      "AWS",
      "Redux Toolkit",
      "Next JS",
      "HTML5",
      "CSS3",
      "SCSS",
      "Tailwind",
      "Material UI",
      "Ant Design",
      "Bootstrap",
      "Jest",
      "Github"
    ],
    "secondary": [
      "Flask (Python)",
      "Python",
      "PWA",
      "JIRA",
      "Some exposure with AWS & React Native"
    ]
  },
  "projects": [
    {
      "url": "https://aurumwisex.com/",
      "name": "Aurumwisex.com",
      "achievements": [
        "India’s premier and largest neo-realty investment platform developed by Aurum PropTech.",
        "Tech Stack: JavaScript, React, Material UI, Redux Saga, AWS Route53, PHP",
        "Supported Platform: Web",
        "Contribution: Architected the platform from its inception, employing custom libraries and sophisticated development techniques, which led to a 40% increase in user engagement."
      ]
    },
    {
      "url": "https://blox.xyz/mumbai",
      "name": "Blox.xyz V.3.0 & V.2.0",
      "achievements": [
        "A pioneering home-buying platform by Method and Madness Technology Pvt Ltd.",
        "Tech Stack: JavaScript, React, Next.js, Material UI, Redux Saga, AWS Route53, AWS Amplify, PHP, React Native",
        "Supported Platform: Web and Mobile",
        "Contribution: Orchestrated the end-to-end development, resulting in a 50% reduction in loading times and a 30% increase in user retention."
      ]
    },
    {
      "url": "https://myprofiletree.in/",
      "name": "TM Profile Tree",
      "achievements": [
        "Digital business cards tailored for entrepreneurs and marketers, facilitating seamless online connectivity and networking.",
        "Tech Stack: JavaScript, React, Material UI v5, Redux Saga, AWS Route53, AWS Amplify",
        "Supported Platform: Web",
        "Contribution: Designed and implemented core features, resulting in a 25% increase in user sign-ups and a 20% decrease in bounce rates."
      ]
    },
    {
      "url": "https://kalabale.lk/",
      "name": "Kalabale",
      "achievements": [
        "An e-commerce platform enabling users to buy or sell new and pre-owned products.",
        "Tech Stack: JavaScript, React, Next.js, TypeScript, Material UI v5, Redux, AWS Route53, AWS Amplify, AWS S3",
        "Supported Platform: Web",
        "Contribution: Led the development process, achieving a 15% increase in transaction volumes and reducing page load times by 40%."
      ]
    },
    {
      "ur": "#",
      "name": "In Memory Of You",
      "achievements": [
        "A social media platform designed to organize and manage funeral events.",
        "Tech Stack: JavaScript, React, Material UI v4, AWS Amplify, AWS S3",
        "Supported Platform: Web",
        "Contribution: Solely managed the front-end deployment process utilizing AWS services."
      ]
    },
    {
      "url": "https://www.octifytechnologies.com/",
      "name": "Octify Technologies",
      "achievements": [
        "The official landing page for a service-based IT company.",
        "Tech Stack: JavaScript, React, Next.js, Bootstrap, AWS Amplify",
        "Supported Platform: Web",
        "Contribution: Architected and developed the entire application from inception, including comprehensive AWS deployment."
      ]
    },
    {
      "url": "#",
      "name": "Recrugenie",
      "achievements": [
        "A platform where users can book professionals such as plumbers and electricians.",
        "Tech Stack: JavaScript, React JS, Material UI v4",
        "Supported Platform: Web",
        "Contribution: Resolved bugs and introduced new features to an already deployed website."
      ]
    },
    {
      "url": "https://www.nic.in/",
      "name": "NIC",
      "achievements": [
        "Developed two access control portals for accepting access requests from other government departments, enabling them to access all IBM APIs purchased by NIC.",
        "Tech Stack: React, JavaScript, Material UI v4",
        "Supported Platform: Web",
        "Contribution: Developed the portals from scratch.",
        "Project Type: Private Government Project"
      ]
    }
  ],
  "wordExperience": [
    {
      "position": "Frontend Developer",
      "company": "Aurum Proptech (Wisex)",
      "date": {
        "joining": "Oct 2023",
        "leaving": "10th Oct 2024"
      },
      "companyDescription": "WiseX is India’s premier neo-realty investment platform by Aurum PropTech.",
      "responsibilities": [
        "Engineered scalable and high-performance web applications utilizing React.js, leading to a 30% improvement in application speed.",
        "Worked with product owners and designers to turn requirements into user-focused designs, boosting delivery speed by 25%.",
        "Optimized application performance with code refactoring and efficient data handling, reducing load times by 40%."
      ]
    },
    {
      "position": "Senior React Developer",
      "company": "Method and Madness Technology Pvt. Ltd.",
      "date": {
        "joining": "Oct 2022",
        "leaving": "Oct 2023"
      },
      "companyDescription": "Blox is a transformative home-buying platform by Method and Madness Technology Pvt Ltd.",
      "responsibilities": [
        "Provided technical leadership and guidance to junior developers, leading to a 20% increase in team productivity.",
        "Designed and developed complex web applications using React.js and related technologies, resulting in a 35% improvement in code efficiency.",
        "Implemented user interfaces, created reusable components, integrated with APIs and back-end services, and ensured code quality and performance optimization, reducing bug reports by 30%.",
        "Equipped implementations with tracking tools such as Google Analytics, Google Tag Manager, Hotjar, among others, improving data accuracy by 25%."
      ]
    },
    {
      "position": "Frontend Developer",
      "company": "Octify Technologies",
      "date": {
        "joining": "Feb 2020",
        "leaving": "Oct 2022"
      },
      "companyDescription": "Octify Technologies is a service-based start-up.",
      "responsibilities": [
        "Led the team as a Team Leader, overseeing ongoing projects and client interactions.",
        "Provided training to junior developers.",
        "Designed, developed, and tested UI for mobile and web applications.",
        "Developed and integrated UX and UI designs that maximize user experience and application usability, ensuring alignment with wireframes.",
        "Translated designs and wireframes into high-quality code."
      ]
    }
  ],
  "certificates": [
    {
      "name": "Certificate of Completion",
      "description": "Front-End Development Libraries and Responsive Web Designing from freeCodeCamp"
    },
    {
      "name": "Certificate of Completion",
      "description": "Web Designing from CYBEROISM"
    }
  ],
  "languages": [
    {
      "name": "Hindi",
      "fluency": "Native or Bilingual Proficiency"
    },
    {
      "name": "English",
      "fluency": "Full Professional Proficiency"
    }
  ],
  "interests": [
    "Leadership",
    "Mentorship",
    "Initiative",
    "Reading",
    "Collaboration",
    "Communication",
    "Adaptability",
    "Creativity",
    "Empathy",
    "Patience",
    "Responsibility",
    "Flexibility",
    "Curiosity"
  ],
  "education": [
    {
      "course": "Master of Computer Applications",
      "institute": "Chandigarh University, Punjab",
      "date": {
        "joining": "02/2022",
        "leaving": "Present"
      }
    },
    {
      "course": "Bachelor of Computer Application",
      "institute": "Maharshi Dayanand University, Haryana",
      "date": {
        "joining": "06/2016",
        "leaving": "05/2019"
      },
      "marks": "60.00%"
    },
    {
      "course": "Senior Secondary Education",
      "institute": "Govt. Co-ed. Sr. Sec. School , CBSE",
      "date": {
        "joining": "04/2015",
        "leaving": "03/2016"
      },
      "marks": "82.00%"
    }
  ]
}
